tests/fixtures/webhooks/refund.created.json

{
    "id": "evt_LX3W6BLcgb2yGBUdm9Xjxu55JqB2FAZD",
    "resource": "event",
    "type": "refund.created",
    "data": {
        "id": "re_D3gN2BpJLZvMTzbBCtARW298AcxNFDxx",
        "resource": "refund",
        "amount": 10000,
        "currency": "PHP",
        "livemode": false,
        "status": "succeeded",
        "description": null,
        "reason": "requested_by_customer",
        "remarks": null,
        "payment_id": "pay_RBwW29aXGwQofjkgYhDeAuLt8u9Urp1U",
        "metadata": null,
        "created_at": 1773749372,
        "updated_at": 1773749372
    },
    "livemode": false,
    "pending_webhooks": 1,
    "previous_attributes": {},
    "created_at": 1773749372,
    "updated_at": 1773749372
}
